[
  {
    "business_name": "Blueprint Coffee",
    "total_reviews_count": "(108 reviews)",
    "reviewer_name": "Saint Louis, MO",
    "location": "Saint Louis, MO",
    "reviewer_date": "Sep 24, 2025",
    "reviewer_text": "Let me start this by saying that I wasn't here last weekend or anything. It's been a while. I wrote this review when I came home to save for when I was holed up in my home recuperating from having my 2nd knee replaced.All that being said, this is based on my first visit. I have been here at least 4 times since. I mean, I gave it a 5 star review didn't I?Anyway, this is their location in the Lindenwood Park Neighborhood. It's a cozy old service station that creates the most tasty drinks. I usually drink a dirty chai. As a matter of fact when I drink one from here I go home and clean my whole house. And, I don't even taste the bitterness of the espresso.Everyone there is super nice. I usually tell them what my go to was at a different place I tried and they give me something from their creative minds. I ALWAYS end up liking it. Speaking of, I have tried to \"make\" cold brew with chocolate milk but it sure doesn't taste anything like theirs. The food was good. We just got a couple of bars that had a lot of grains and seeds. (Yes, I didn't write down the name of them.) Those bars kept my tummy full for a long time and was really good.It's not the biggest space but there is space to sit outside, again, not a lot, but that is typical honestly. There is a little parking lot in front of the building but honestly, I would stick to the streets. It's just easier.You know I will definitely be back. I've already been back 4 times."
  },
  {
    "business_name": "Blueprint Coffee",
    "total_reviews_count": "(108 reviews)",
    "reviewer_name": "Saint Louis, MO",
    "location": "Saint Louis, MO",
    "reviewer_date": "Sep 19, 2025Updated review",
    "reviewer_text": "Today, as summer gives way to fall, I'm taking some moments to read, absorb, and savor a really good cup of coffee. St. Louis has made solid spots, but if I'm going to enjoy something nuanced, well-sourced, and delicious, I'm coming to Blueprint Coffee on Watson.I love the whole vibe of this place - natural light spilling through the many windows of this former car garage, good music playing, plants everywhere, warm wood, yellow furniture, and non-pretentious, friendly baristas - and the single cup coffee is a fave. Today's cup was Turaco, rich, dark, with some smoke and tart berry.When it's really nice outside, they roll the garage doors up, and the breeze paired with everything else is glorious. There's long communal table seating inside and a back patio with multi-top tables under shade, so whatever dynamic you're looking for with your coffee, Blueprint offers it.Solid breakfast sandwiches, pastries, and more, as well. It's definitely a go-to coffeehouse for me in the city when I'm just wanting space to sip, savor, and enjoy."
  },
  {
    "business_name": "Blueprint Coffee",
    "total_reviews_count": "(108 reviews)",
    "reviewer_name": "Bethalto, IL",
    "location": "Bethalto, IL",
    "reviewer_date": "Dec 21, 2024Updated review",
    "reviewer_text": "Blueprint has the best latte in St. Louis (out of all the places I've tried! My favorite is the ice caramel latte with whole milk (not much of a non-dairy milk gal).The Watson location also has a little outside area. Not as many seating spots inside, but still a good size. Parking lot can only hold 3 cars but street parking is usually super easy to find.The staff is always knowledgeable and kind. I always look forward to stopping in! There's usually always a line but it goes quick.They have food options (some vegan options for folks who need it)."
  },
  {
    "business_name": "Blueprint Coffee",
    "total_reviews_count": "(108 reviews)",
    "reviewer_name": "Kirkwood, MO",
    "location": "Kirkwood, MO",
    "reviewer_date": "Jul 13, 2024",
    "reviewer_text": "Fun little coffee spot!Lots of different drink options and a few good offerings. I liked the decor and the use of roll up doors to help make the space more open and airy.Staff was helpful in picking options and patient while we figured out what to try. My wife and daughter got coffees while I tried an iced tea.Cool spot to hang out. No drive through, not that kind of coffee place!"
  },
  {
    "business_name": "Blueprint Coffee",
    "total_reviews_count": "(108 reviews)",
    "reviewer_name": "Saint Louis, MO",
    "location": "Saint Louis, MO",
    "reviewer_date": "Apr 30, 2025",
    "reviewer_text": null
  },
  {
    "business_name": "Blueprint Coffee",
    "total_reviews_count": "(108 reviews)",
    "reviewer_name": "Clifton, NJ",
    "location": "Clifton, NJ",
    "reviewer_date": "Nov 19, 2024",
    "reviewer_text": "Coffee not for the faint of heart! Sure it's strong and will definitely put hair on your chest. It's Java love at first sip."
  },
  {
    "business_name": "Blueprint Coffee",
    "total_reviews_count": "(108 reviews)",
    "reviewer_name": "Tower Grove East, Saint Louis, MO",
    "location": "Tower Grove East, Saint Louis, MO",
    "reviewer_date": "Jan 17, 2024",
    "reviewer_text": "Blueprint has the most amazing coffee. Chances are, if your favorite local coffee shop doesn't roast their own coffee beans, they probably get them from Blueprint. They have perfect the roasting process. They have a great food menu, too! I got the sausage & pepper egg biscuit and it was gooood. This is also one of the more family friendly coffee shops I've been to. The baristas are so sweet to kids, they even have stickers for them, and they have these really low tables that are perfect for kids. Also,if you buy a bag of coffee beans, you get a free drink! It's sweet. The one con is it's not a great place to sit and work. There isn't a lot of seating, and the only outlets are by the bench with low tables."
  },
  {
    "business_name": "Blueprint Coffee",
    "total_reviews_count": "(108 reviews)",
    "reviewer_name": "Saint Louis, MO",
    "location": "Saint Louis, MO",
    "reviewer_date": "Feb 27, 2025",
    "reviewer_text": "Always a pleasure stopping in for coffee whether it's to-go or to stay and enjoy there. Don't let the size fool you, plenty of seating inside and on their back patio. Come for the coffee, stay for the cookies; their oatmeal with banana, coconut, dried cherry & Askinosie chocolate is delicious!"
  },
  {
    "business_name": "Blueprint Coffee",
    "total_reviews_count": "(108 reviews)",
    "reviewer_name": "Saint Louis, MO",
    "location": "Saint Louis, MO",
    "reviewer_date": "Nov 11, 2023",
    "reviewer_text": "Blueprint is my favorite coffee shop. From their great selection of baked goods to their incredible coffee selection they have been our go to for our coffee needs and friend dates. I always go for the biscuit with butter + jam or the egg biscuit sandwich both are 10/10! The egg sandwich has a tomato jam that is too die for and they have truly perfected the egg patty. For coffee, my partner loves their cold brew and I tend to go for their lattes usually with oat milk and salted caramel syrup but you can never go wrong with their seasonal drinks.Ambiance-- they are always playing incredible music, they have seating areas in the front and back of the cafe, tons of plants to brighten even the grayest of days. They host markets in the front lot and even have a basketball hoop if you are feeling up to shooting some shots.Service-- we love everyone that works here! They are incredibly warm, helpful, and you can tell they care deeply about their customers. Really thankful that we have this gem close by. They are the reason why we are regulars. Shoutout to Ethan, Micah, Ashley, MG, Ryan, Jordan and Britton."
  },
  {
    "business_name": "Blueprint Coffee",
    "total_reviews_count": "(108 reviews)",
    "reviewer_name": "St. Louis, MO",
    "location": "St. Louis, MO",
    "reviewer_date": "Aug 12, 2023",
    "reviewer_text": "Two things about me: I love a seasonal drink and a reimagined building!Once upon a time, Blueprint Coffee Bar's Watson location was an auto-repair shop. The garage doors lend gorgeous natural lighting to the transformed space and the walk-up window makes for a warm welcome when the weather is right! The back patio is a neat little plant-filled nook, the perfect shaded spot for summer sips."
  },
  {
    "business_name": "Blueprint Coffee",
    "total_reviews_count": "(108 reviews)",
    "reviewer_name": null,
    "location": null,
    "reviewer_date": null,
    "reviewer_text": null
  }
]